In [61]:
import pandas as pd
import numpy as np

## DataFrame

In [62]:
forum_users = {
    'User ID': [1,2,3,4,5],
    'Username': ['bogdan_s','jane_smith','alex123','bob56','mark_wilson'],
    'Age':[18,35,25,38,45],
    'Joined Date':['2023-01-01','2023-02-01','2023-03-01','2023-04-01','2023-05-01'],
    'Total Posts':[150,230,80,420,310],
    'Reputation':[500,720,200,940,500]
}

In [63]:
df = pd.DataFrame(forum_users)
df

   User ID     Username  Age Joined Date  Total Posts  Reputation
0        1     bogdan_s   18  2023-01-01          150         500
1        2   jane_smith   35  2023-02-01          230         720
2        3      alex123   25  2023-03-01           80         200
3        4        bob56   38  2023-04-01          420         940
4        5  mark_wilson   45  2023-05-01          310         500

In [64]:
df.shape

(5, 6)

In [65]:
type(df)

pandas.core.frame.DataFrame

In [66]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [67]:
df.columns # По оси 1

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [68]:
df.index # Список осей

RangeIndex(start=0, stop=5, step=1)

In [69]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [70]:
df.dtypes

User ID         int64
Username       object
Age             int64
Joined Date    object
Total Posts     int64
Reputation      int64
dtype: object

In [71]:
df.values

array([[1, 'bogdan_s', 18, '2023-01-01', 150, 500],
       [2, 'jane_smith', 35, '2023-02-01', 230, 720],
       [3, 'alex123', 25, '2023-03-01', 80, 200],
       [4, 'bob56', 38, '2023-04-01', 420, 940],
       [5, 'mark_wilson', 45, '2023-05-01', 310, 500]], dtype=object)

In [72]:
type(df.values)

numpy.ndarray

In [73]:
df.values[1,1]

'jane_smith'

In [74]:
df.head

<bound method NDFrame.head of    User ID     Username  Age Joined Date  Total Posts  Reputation
0        1     bogdan_s   18  2023-01-01          150         500
1        2   jane_smith   35  2023-02-01          230         720
2        3      alex123   25  2023-03-01           80         200
3        4        bob56   38  2023-04-01          420         940
4        5  mark_wilson   45  2023-05-01          310         500>

In [75]:
df.head(3) # Получаем количество строк с начала

   User ID    Username  Age Joined Date  Total Posts  Reputation
0        1    bogdan_s   18  2023-01-01          150         500
1        2  jane_smith   35  2023-02-01          230         720
2        3     alex123   25  2023-03-01           80         200

In [76]:
df.tail(2) # Получаем количество строк с конца

   User ID     Username  Age Joined Date  Total Posts  Reputation
3        4        bob56   38  2023-04-01          420         940
4        5  mark_wilson   45  2023-05-01          310         500

In [77]:
df.describe() # Получить статистику по колонкам с int и float значениями

# std - это стандарное отклонение 
# Чем больше разброс значений на кривой от среднеего значения, к примеру 32 тем больше отклонения, сменить 45 в Age на 30
# То стандартное отклонение станет меньше, поскольку все значения стали ближе к сренему возрасту 32 (рис)

        User ID        Age  Total Posts  Reputation
count  5.000000   5.000000     5.000000    5.000000
mean   3.000000  32.200000   238.000000  572.000000
std    1.581139  10.709809   133.304163  276.622486
min    1.000000  18.000000    80.000000  200.000000
25%    2.000000  25.000000   150.000000  500.000000
50%    3.000000  35.000000   230.000000  500.000000
75%    4.000000  38.000000   310.000000  720.000000
max    5.000000  45.000000   420.000000  940.000000

In [78]:
df.describe().round(2)

       User ID    Age  Total Posts  Reputation
count     5.00   5.00          5.0        5.00
mean      3.00  32.20        238.0      572.00
std       1.58  10.71        133.3      276.62
min       1.00  18.00         80.0      200.00
25%       2.00  25.00        150.0      500.00
50%       3.00  35.00        230.0      500.00
75%       4.00  38.00        310.0      720.00
max       5.00  45.00        420.0      940.00

In [79]:
df.select_dtypes

<bound method DataFrame.select_dtypes of    User ID     Username  Age Joined Date  Total Posts  Reputation
0        1     bogdan_s   18  2023-01-01          150         500
1        2   jane_smith   35  2023-02-01          230         720
2        3      alex123   25  2023-03-01           80         200
3        4        bob56   38  2023-04-01          420         940
4        5  mark_wilson   45  2023-05-01          310         500>

In [80]:
df.select_dtypes(include='object')

      Username Joined Date
0     bogdan_s  2023-01-01
1   jane_smith  2023-02-01
2      alex123  2023-03-01
3        bob56  2023-04-01
4  mark_wilson  2023-05-01

In [81]:
df.select_dtypes(include='object').columns

Index(['Username', 'Joined Date'], dtype='object')

In [82]:
df.select_dtypes(include='int64')

   User ID  Age  Total Posts  Reputation
0        1   18          150         500
1        2   35          230         720
2        3   25           80         200
3        4   38          420         940
4        5   45          310         500

In [83]:
df.isna() # Данные которые не доступны сменим один Age None и он станет  True

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False  False        False        False       False

In [84]:
# Преобразуем в даты и используем NumPy
forum_users = {
    'User ID': np.array([1,2,3,4,5]),
    'Username': ['bogdan_s','jane_smith','alex123','bob56','mark_wilson'],
    'Age': np.array([18,35,25,38,None]),
    'Joined Date': pd.to_datetime(['2023-01-01','2023-02-01','2023-03-01','2023-04-01','2023-05-01']),
    'Total Posts': np.array([150,230,80,420,310]),
    'Reputation': np.array([500,720,200,940,500])
}
df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s    18  2023-01-01          150         500
1        2   jane_smith    35  2023-02-01          230         720
2        3      alex123    25  2023-03-01           80         200
3        4        bob56    38  2023-04-01          420         940
4        5  mark_wilson  None  2023-05-01          310         500

In [85]:
df.dtypes

User ID                 int32
Username               object
Age                    object
Joined Date    datetime64[ns]
Total Posts             int32
Reputation              int32
dtype: object

In [86]:
df.values

array([[1, 'bogdan_s', 18, Timestamp('2023-01-01 00:00:00'), 150, 500],
       [2, 'jane_smith', 35, Timestamp('2023-02-01 00:00:00'), 230, 720],
       [3, 'alex123', 25, Timestamp('2023-03-01 00:00:00'), 80, 200],
       [4, 'bob56', 38, Timestamp('2023-04-01 00:00:00'), 420, 940],
       [5, 'mark_wilson', None, Timestamp('2023-05-01 00:00:00'), 310,
        500]], dtype=object)

In [87]:
df.describe().round(2)

       User ID          Joined Date  Total Posts  Reputation
count     5.00                    5          5.0        5.00
mean      3.00  2023-03-02 00:00:00        238.0      572.00
min       1.00  2023-01-01 00:00:00         80.0      200.00
25%       2.00  2023-02-01 00:00:00        150.0      500.00
50%       3.00  2023-03-01 00:00:00        230.0      500.00
75%       4.00  2023-04-01 00:00:00        310.0      720.00
max       5.00  2023-05-01 00:00:00        420.0      940.00
std       1.58                  NaN        133.3      276.62

In [88]:
df.isna().sum() # Данные которые не доступны сменим один Age None и он станет  True

User ID        0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64

In [89]:
type(df.isna().sum())

pandas.core.series.Series

## Series

In [106]:
## По сути Series это каждая колонка с которой мы делаем манипуляции

In [107]:
df['Username']

0       bogdan_s
1     jane_smith
2        alex123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [108]:
type(df['Username'])

pandas.core.series.Series

In [109]:
username_series = df['Username']
username_series.values

array(['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
      dtype=object)

In [110]:
type(username_series.values)

numpy.ndarray

In [111]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [112]:
username_series.value_counts()

Username
bogdan_s       1
jane_smith     1
alex123        1
bob56          1
mark_wilson    1
Name: count, dtype: int64

In [113]:
username_series.value_counts().index

Index(['bogdan_s', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'], dtype='object', name='Username')

In [114]:
df['Reputation'].value_counts()

Reputation
500    2
720    1
200    1
940    1
Name: count, dtype: int64

In [115]:
df['Reputation'].value_counts(ascending=True)

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [116]:
df['Reputation'].unique()

array([500, 720, 200, 940])

In [117]:
 df['Username'].sort_values()

2        alex123
3          bob56
0       bogdan_s
1     jane_smith
4    mark_wilson
Name: Username, dtype: object

In [118]:
 df['Username'].sort_index()

0       bogdan_s
1     jane_smith
2        alex123
3          bob56
4    mark_wilson
Name: Username, dtype: object

In [119]:
 df['Username'].sort_index(ascending=False)

4    mark_wilson
3          bob56
2        alex123
1     jane_smith
0       bogdan_s
Name: Username, dtype: object